Q101. Write the Python program to add, subtract, multiply and divide two pandas series ?

In [2]:
import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

Q102. Write a Python program to convert a dictionary to the Pandas Series?

In [3]:
import pandas as pd
d1 = {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':800}
print("Original dictionary:")
print(d1) 
new_series = pd.Series(d1)
print("Converted series:")
print(new_series)

Original dictionary:
{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
Converted series:
a    100
b    200
c    300
d    400
e    800
dtype: int64

Q103. Write a python program to change the data type of given a column or a Series?

In [4]:
import pandas as pd
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s1)
print("Change the said data type to numeric:")
s2 = pd.to_numeric(s1, errors='coerce')
print(s2)

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Change the said data type to numeric:
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q104. Write the python pandas program to convert the first column of a DataFrame as a Series?

In [7]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
#s1 = df.ix[:,0]
s1=df.iloc[:,0]
print(s1)
print(type(s1))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

Q105. Write a pandas program to create the mean and standard deviation of the data of a given Series?

In [8]:
import pandas as pd
s = pd.Series(data = [1,2,3,4,5,6,7,8,9,5,3])
print("Original Data Series:")
print(s)
print("Mean of the said Data Series:")
print(s.mean())
print("Standard deviation of the said Data Series:")
print(s.std())

Original Data Series:
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int64
Mean of the said Data Series:
4.818181818181818
Standard deviation of the said Data Series:
2.522624895547565

Q106. Write a pandas program to get powers of an array values element-wise?

In [9]:
import pandas as pd
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Q107. Write the pandas program to get the first 3 rows of a given DataFrame?

In [14]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
#df.head(3)
print(df.iloc[:3])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Q108: Write the pandas program to select the specified columns and the rows from a given data frame?

In [32]:
import pandas as pd

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
df=pd.DataFrame(data=exam_data,index=labels)
df.iloc[[1,3,5,6],[0,1]]

        name  score
 b      Dima    9.0
 d     James    NaN
 f   Michael   20.0
 g   Matthew   14.5

Q109. Write the pandas program to calculate mean score for each different student in DataFrame?

In [37]:
import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
df=pd.DataFrame(data=exam_data,index=labels)
print(df['score'].mean())

13.5625

Q110. Write the Pandas program to rename columns of a given DataFrame ?

In [39]:
import pandas as pd 
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
df.columns={'column1','column2','column3'}
df = df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
print("New DataFrame after renaming columns:") 
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
New DataFrame after renaming columns:
   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

Q111. Write a pandas program to count city-wise number of people from a given of data set (city, name of the person)?

In [40]:
import pandas as pd
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
g1 = df1.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

Q112. Write a pandas program to widen output display to see more columns?

In [41]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]} 
df = pd.DataFrame(data=d) 
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print("Original DataFrame") 
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q113. Write a pandas program to convert the data frame column type from string to DateTime?

In [43]:
import pandas as pd
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print("String Date:")
print(s)
r = pd.to_datetime(pd.Series(s))
df = pd.DataFrame(r)
print("Original DataFrame (string to datetime):")
print(df)

String Date:
0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object
Original DataFrame (string to datetime):
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

Q114. Write a pandas program to append the data to an empty DataFrame?

In [44]:
import pandas as pd
import numpy as np
df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
print("After appending some data:")
df = df.append(data)
print(df)

After appending some data:
   col1  col2
0     0     0
1     1     1
2     2     2

Q115. Write a pandas program to count the number of columns of a DataFrame?

In [45]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nNumber of columns:")
print(len(df.columns))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Number of columns:
3

Q116. Write a Pandas program to remove the last n rows of a given DataFrame ?

In [50]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("original dataframe")
print(df)
df=df.iloc[:3]
print("After removing column dataframe")
print(df)

original dataframe
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
After removing column dataframe
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

Q117. Write a Pandas program to import excel data (coalpublic2013.xlsx ) into a Pandas data frame.

In [53]:
import pandas as pd
df=pd.read_excel("coalpublic2013.xlsx")
print(df.head())

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393

Q118. Write a Pandas program to import excel data (coalpublic2013.xlsx ) into a data frame and find details where "Mine Name" starts with "P.

In [63]:
import pandas as pd
df=pd.read_excel("coalpublic2013.xlsx")
df[df['Mine_Name'].map(lambda x: x.startswith('P'))].head()

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

Q119. Write a Pandas program to import excel data (employee.xlsx ) into a Pandas dataframe and find the list of employees where hire_date> 01-01-07.

In [71]:
import pandas as pd
df=pd.read_excel("employee.xlsx")
df[df['hire_date'] >='20070101']
#df[df['hire_date'].map(lambda x: x is greterthan '01-01-07')]

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10

Q120. Write a Pandas program to import excel data (employee.xlsx ) into a Pandas dataframe and find a list of the employees of a specified year

In [75]:
import pandas as pd
df=pd.read_excel("employee.xlsx")
df2 = df.set_index(['hire_date'])
result = df2["2005"]
result

            emp_id first_name last_name
hire_date
2005-09-21     101      Neena   Kochhar
2005-06-25     105      David    Austin
2005-09-28     110       John      Chen
2005-09-30     111     Ismael   Sciarra
2005-12-24     116     Shelli     Baida
2005-07-24     117      Sigal    Tobias

Q121. Write a pandas program to import three datasheets from a given excel data (coalpublic2013.xlsx ) in to a single dataframe.

In [82]:
import pandas as pd 
import numpy as np
df1 = pd.read_excel('employee.xlsx',sheet_name=0)
df2 = pd.read_excel('employee.xlsx',sheet_name=1)
df3 = pd.read_excel('employee.xlsx',sheet_name=2)
df = pd.concat([df1, df2, df3])
print(df)

    emp_id   first_name    last_name  hire_date
0      100       Steven         King 2003-06-17
1      101        Neena      Kochhar 2005-09-21
2      102          Lex      De Haan 2001-01-13
3      103    Alexander       Hunold 2006-01-03
4      104        Bruce        Ernst 2007-05-21
5      105        David       Austin 2005-06-25
6      106        Valli    Pataballa 2006-02-05
7      107        Diana      Lorentz 2007-02-07
8      108        Nancy    Greenberg 2002-08-17
9      109       Daniel       Faviet 2002-08-16
10     110         John         Chen 2005-09-28
11     111       Ismael      Sciarra 2005-09-30
12     112  Jose Manuel        Urman 2006-03-07
13     113         Luis         Popp 2007-12-07
14     114          Den     Raphaely 2002-12-07
15     115    Alexander         Khoo 2003-05-18
16     116       Shelli        Baida 2005-12-24
17     117        Sigal       Tobias 2005-07-24
18     118          Guy       Himuro 2006-11-15
19     119        Karen   Colmenares 2007-08-10
0      120      Matthew        Weiss 2004-07-18
1      121         Adam        Fripp 2005-04-10
2      122        Payam     Kaufling 2003-05-01
3      123       Shanta      Vollman 2005-10-10
4      124        Kevin      Mourgos 2007-11-16
5      125        Julia        Nayer 2005-07-16
6      126        Irene  Mikkilineni 2006-09-28
7      127        James       Landry 2007-01-14
8      128       Steven       Markle 2008-03-08
9      129        Laura       Bissot 2005-08-20
10     130        Mozhe     Atkinson 2005-10-30
11     131        James       Marlow 2005-02-16
12     132           TJ        Olson 2007-04-10
13     133        Jason       Mallin 2004-06-14
14     134      Michael       Rogers 2006-08-26
15     135           Ki          Gee 2007-12-12
16     136        Hazel   Philtanker 2008-02-06
17     137       Renske       Ladwig 2003-07-14
18     138      Stephen       Stiles 2005-10-26
0      141       Trenna         Rajs 2003-10-17
1      142       Curtis       Davies 2005-01-29
2      143      Randall        Matos 2006-03-15
3      144        Peter       Vargas 2006-07-09
4      145         John      Russell 2004-10-01
5      146        Karen     Partners 2005-01-05
6      147      Alberto    Errazuriz 2005-03-10
7      148       Gerald    Cambrault 2007-10-15
8      149        Eleni      Zlotkey 2008-01-29

Q 122. Write a pandas program to import three datasheets from a given excel data (employee.xlsx ) into a single data frame and export the result into new Excel file.

In [81]:
import pandas as pd
import numpy as np
df1 = pd.read_excel('employee.xlsx',sheet_name=0)
df2 = pd.read_excel('employee.xlsx',sheet_name=1)
df3 = pd.read_excel('employee.xlsx',sheet_name=2)
df = pd.concat([df1, df2, df3]) 
df.to_excel('output.xlsx', index=False)

Q123. Write a pandas program to create the Pivot table with multiple indexes from the data set of the titanic.csv.

In [83]:
import pandas as pd
import numpy as np
df = pd.read_csv('titanic.csv')
result = pd.pivot_table(df, index = ["sex","age"], aggfunc=np.sum)
print(result)

              Unnamed: 15  adult_male  alone      fare  parch  pclass  sibsp  survived
sex    age
female 0.75           0.0         0.0    0.0   38.5166      2       6      4         2
       1.00           0.0         0.0    0.0   26.8750      3       6      1         2
       2.00           0.0         0.0    0.0  259.4750      9      15      9         2
       3.00           0.0         0.0    0.0   62.6542      3       5      4         1
       4.00           0.0         0.0    0.0  114.1417      6      13      4         5
       5.00           0.0         0.0    1.0   90.8708      5      11      7         4
       6.00           0.0         0.0    0.0   64.2750      3       5      4         1
       7.00           0.0         0.0    0.0   26.2500      2       2      0         1
       8.00           0.0         0.0    0.0   47.3250      3       5      3         1
       9.00           0.0         0.0    0.0  108.7958      7      12     10         0
       10.00          0.0         0.0    0.0   24.1500      2       3      0         0
       11.00          0.0         0.0    0.0   31.2750      2       3      4         0
       13.00          0.0         0.0    1.0   26.7292      1       5      0         2
       14.00          0.0         0.0    1.0  169.1667      2       9      3         3
       14.50          0.0         0.0    0.0   14.4542      0       3      1         0
       15.00          0.0         0.0    2.0  241.0459      1      10      1         4
       16.00          0.0         0.0    3.0  246.2625      4      12      5         5
       17.00          0.0         0.0    3.0  210.7833      2      12      6         5
       18.00          0.0         0.0    4.0  697.0167      9      31      6         8
       19.00          0.0         0.0    3.0  215.0959      2      13      3         7
       20.00          0.0         0.0    1.0   18.4875      0       6      1         0
       21.00          0.0         0.0    4.0  410.4333      4      16      5         4
       22.00          0.0         0.0    7.0  444.1084      6      26      3        10
       23.00          0.0         0.0    3.0  405.5417      2      10      4         4
       24.00          0.0         0.0    7.0  772.1708     15      31     10        14
       25.00          0.0         0.0    1.0  223.2500      4      11      3         2
       26.00          0.0         0.0    3.0  136.7292      1      12      2         3
       27.00          0.0         0.0    2.0   76.8916      3      15      2         5
       28.00          0.0         0.0    4.0  110.9458      1      16      3         5
       29.00          0.0         0.0    2.0  320.6208      7      16      3         5
       30.00          0.0         0.0    9.0  465.9917      1      20      4         9
       30.50          0.0         0.0    1.0    7.7500      0       3      0         0
       31.00          0.0         0.0    2.0  359.4542      4      16      4         5
       32.00          0.0         0.0    2.0  104.7917      1       6      1         2
       32.50          0.0         0.0    1.0   13.0000      0       2      0         1
       33.00          0.0         0.0    1.0  299.2000      4      10      6         6
       34.00          0.0         0.0    2.0   79.0000      2       8      1         4
       35.00          0.0         0.0    3.0  967.7875      1      11      5         8
       36.00          0.0         0.0    3.0  396.0333      4      12      3         7
       37.00          0.0         0.0    1.0    9.5875      0       3      0         0
       38.00          0.0         0.0    3.0  423.1958      5       8      2         4
       39.00          0.0         0.0    0.0  389.9916     13      10      5         4
       40.00          0.0         0.0    3.0  365.1875      2      11      3         5
       41.00          0.0         0.0    1.0  213.9000      8       9      0         2
       42.00          0.0         0.0    2.0  266.5250      0       5      1         3
       43.00          0.0         0.0    0.0  258.2375      7       4      1         1
       44.00          0.0         0.0    1.0  111.7000      1       4      1         2
       45.00          0.0         0.0    2.0  254.7209      7      14      3         3
       47.00          0.0         0.0    0.0   67.0542      1       4      2         1
       48.00          0.0         0.0    1.0  164.9042      5       7      3         3
       49.00          0.0         0.0    1.0  102.6584      0       2      1         2
       50.00          0.0         0.0    3.0  323.2333      2       8      0         4
       51.00          0.0         0.0    0.0   77.9583      0       1      1         1
       52.00          0.0         0.0    0.0  171.7667      1       2      2         2
       53.00          0.0         0.0    0.0   51.4792      0       1      2         1
       54.00          0.0         0.0    0.0  160.6667      3       4      3         3
       55.00          0.0         0.0    1.0   16.0000      0       2      0         1
       56.00          0.0         0.0    0.0   83.1583      1       1      0         1
       57.00          0.0         0.0    1.0   10.5000      0       2      0         0
       58.00          0.0         0.0    2.0  326.5333      1       3      0         3
       60.00          0.0         0.0    0.0   75.2500      0       1      1         1
       62.00          0.0         0.0    1.0   80.0000      0       1      0         1
       63.00          0.0         0.0    1.0   87.5458      0       4      1         2
male   0.42           0.0         0.0    0.0    8.5167      1       3      0         1
       0.67           0.0         0.0    0.0   14.5000      1       2      1         1
       0.83           0.0         0.0    0.0   47.7500      3       4      1         2
       0.92           0.0         0.0    0.0  151.5500      2       1      1         1
       1.00           0.0         0.0    0.0  183.1667      8      13     12         3
       2.00           0.0         0.0    0.0  115.8875      4      11     12         1
       3.00           0.0         0.0    0.0   92.0375      5      10      7         4
       4.00           0.0         0.0    0.0  181.2916      8      13     12         2
       6.00           0.0         0.0    0.0   12.4750      1       3      0         1
       7.00           0.0         0.0    0.0   68.8125      2       6      8         0
       8.00           0.0         0.0    0.0   65.8750      2       5      5         1
       9.00           0.0         0.0    0.0  114.7125      7      12     10         2
       10.00          0.0         0.0    0.0   27.9000      2       3      3         0
       11.00          0.0         0.0    1.0  185.6875      4       7      6         1
       12.00          0.0         0.0    0.0   11.2417      0       3      1         1
       14.00          0.0         0.0    0.0   86.5875      3       6      9         0
       15.00          0.0         0.0    0.0    7.2292      1       3      1         0
       16.00          0.0        11.0    7.0  191.4042      5      31      8         1
       17.00          0.0         7.0    4.0  158.2792      3      19      2         1
       18.00          0.0        13.0    9.0  292.6333      2      33      4         1
       19.00          0.0        18.0   15.0  481.6415      3      46      5         2
       20.00          0.0        13.0   11.0  110.8751      1      39      2         3
       20.50          0.0         1.0    1.0    7.2500      0       3      0         0
       21.00          0.0        17.0   14.0  347.1416      1      46      3         1
       22.00          0.0        15.0   14.0  244.5207      0      43      1         1
       23.00          0.0        10.0    8.0  164.3791      2      22      2         1
       23.50          0.0         1.0    1.0    7.2292      0       3      0         0
       24.00          0.0        14.0   10.0  518.8999      1      35      5         1
       24.50          0.0         1.0    1.0    8.0500      0       3      0         0
       25.00          0.0        18.0   11.0  338.3126      2      45      7         4
       26.00          0.0        13.0    9.0  206.8333      2      36      5         3
       27.00          0.0        12.0    9.0  469.6125      2      25      2         6
       28.00          0.0        18.0   14.0  414.5582      1      42      4         2
       28.50          0.0         2.0    2.0   23.3292      0       6      0         0
       29.00          0.0        13.0    9.0  221.1957      0      32      4         3
       30.00          0.0        14.0   12.0  172.5500      0      35      2         1
       30.50          0.0         1.0    1.0    8.0500      0       3      0         0
       31.00          0.0        10.0    6.0  269.7000      2      20      4         3
       32.00          0.0        15.0   12.0  333.0291      0      40      4         7
       32.50          0.0         1.0    0.0   30.0708      0       2      1         0
       33.00          0.0         9.0    8.0   88.1833      1      24      1         0
       34.00          0.0        11.0    7.0  170.5458      1      25      4         2
       34.50          0.0         1.0    1.0    6.4375      0       3      0         0
       35.00          0.0        10.0   10.0  639.8375      0      22      0         3
       36.00          0.0        15.0    9.0  923.1958      6      29      5         4
       36.50          0.0         1.0    0.0   26.0000      2       2      0         0
       37.00          0.0         5.0    0.0  169.2792      2       8      5         1
       38.00          0.0         6.0    4.0  267.0708      1      12      1         1
       39.00          0.0         8.0    7.0  123.2750      5      19      1         1
       40.00          0.0         7.0    5.0  117.2416      5      15      2         1
       40.50          0.0         2.0    1.0   22.2500      2       6      0         0
       41.00          0.0         2.0    1.0   21.2333      0       6      2         0
       42.00          0.0        10.0    6.0  216.1084      1      21      3         3
       43.00          0.0         3.0    2.0   40.7500      1       8      1         0
       44.00          0.0         6.0    3.0  156.1250      1      15      3         1
       45.00          0.0         6.0    5.0  187.1000      0      10      1         2
       45.50          0.0         2.0    2.0   35.7250      0       4      0         0
       46.00          0.0         3.0    2.0  166.3750      0       4      1         0
       47.00          0.0         7.0    7.0  181.3583      0      12      0         0
       48.00          0.0         5.0    3.0  176.1334      0       8      2         3
       49.00          0.0         4.0    1.0  256.9167      1       6      3         2
       50.00          0.0         5.0    2.0  317.0250      0       8      4         1
       51.00          0.0         6.0    5.0  123.3084      1      13      0         1
       52.00          0.0         4.0    3.0  136.6500      1       6      1         1
       54.00          0.0         5.0    3.0  195.1500      1       8      1         0
       55.00          0.0         1.0    1.0   30.5000      0       1      0         0
       55.50          0.0         1.0    1.0    8.0500      0       3      0         0
       56.00          0.0         3.0    3.0   92.7458      0       3      0         1
       57.00          0.0         1.0    1.0   12.3500      0       2      0         0
       58.00          0.0         2.0    1.0  142.9750      2       2      0         0
       59.00          0.0         2.0    2.0   20.7500      0       5      0         0
       60.00          0.0         3.0    1.0  144.7500      2       4      2         1
       61.00          0.0         3.0    3.0   72.0583      0       5      0         0
       62.00          0.0         3.0    3.0   63.6000      0       4      0         1
       64.00          0.0         2.0    1.0  289.0000      4       2      1         0
       65.00          0.0         3.0    2.0   96.2792      1       5      0         0
       66.00          0.0         1.0    1.0   10.5000      0       2      0         0
       70.00          0.0         2.0    1.0   81.5000      1       3      1         0
       70.50          0.0         1.0    1.0    7.7500      0       3      0         0
       71.00          0.0         2.0    2.0   84.1584      0       2      0         0
       74.00          0.0         1.0    1.0    7.7750      0       3      0         0
       80.00          0.0         1.0    1.0   30.0000      0       1      0         1

Q124. Write a Pandas program to create the Pivot table and find survival rate by gender?

In [84]:
import pandas as pd
import numpy as np
df = pd.read_csv('titanic.csv')
result=df.groupby('sex')[['survived']].mean() 
print(result)

        survived
sex
female  0.742038
male    0.188908

Q125. Write a pandas program to make partition each of the passengers into 4 categories based on their age.

In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv('titanic.csv')
result = pd.cut(df['age'], [0, 10, 30, 60, 80]) print(result)